CREATE TABLE IF NOT EXISTS "bu_offices" (
	"bu" "bu" PRIMARY KEY NOT NULL,
	"address" text NOT NULL,
	"phone" varchar(160),
	"updated_at" timestamp with time zone DEFAULT now() NOT NULL,
	"updated_by" integer REFERENCES "users"("id")
);
--> statement-breakpoint
INSERT INTO "bu_offices" ("bu","address","phone") VALUES
	('BU1','7/7 หมู่ที่ 4 ตำบลบ้านใหม่ อำเภอเมืองปทุมธานี จังหวัดปทุมธานี','084-2539151'),
	('BU6','7/7 หมู่ที่ 4 ตำบลบ้านใหม่ อำเภอเมืองปทุมธานี จังหวัดปทุมธานี','084-2539151'),
	('BU7','7/7 หมู่ที่ 4 ตำบลบ้านใหม่ อำเภอเมืองปทุมธานี จังหวัดปทุมธานี','084-2539151'),
	('BU3','39/1 ถนนราษฎร์ยินดี 7 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110','084-2539151'),
	('BU4','39/1 ถนนราษฎร์ยินดี 7 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110','084-2539151'),
	('BU5','39/1 ถนนราษฎร์ยินดี 7 ตำบลหาดใหญ่ อำเภอหาดใหญ่ จังหวัดสงขลา 90110','084-2539151'),
	('BU2','เลขที่ 261/87 หมู่ที่ 1 ตำบลเทพกระษัตรี อำเภอถลาง จังหวัดภูเก็ต','084-2539151')
ON CONFLICT ("bu") DO NOTHING;
